export const lessons = {
  lesson1: {
    video: 'DQACAgIAAxkBAAMeZ5vecu9EQwWtEyawQuWpUijWJJsAAmlrAAKsdOBI0P_JVahQDRQ2BA',
    text: '📚 Добро пожаловать на урок! Посмотрите видео, затем отправьте фото готового изделия.'
  }
};

export const startMessages = [
  [

  ]
]

export const meetExperts = "👩‍🔬 После прохождения теста, приглашаю познакомится с экспертами.";

export const lessonPreDescription = `💠 При успешном выполнении урока вы получите мой авторский рецепт в подарок.\n\n💠 Для успешного выполнения урока, вам нужно будет отослать в бот фото готового изделия.\n\n💠 Срок выполнения - 3 дня.\n\n💠 Чтобы начать урок, нажмите на кнопку "Начать урок", после чего бот вышлет вам всю нужную информацию. Но учтите, что обратный отсчет начнется сразу после нажатия.\n\nЖелаю удачи!`;

export const lessonNotCompleted = `УРОК ПРОВАЛЕН`