export const testQuestions = [
  {
    question: "Как ты предпочитаешь работать?",
    options: ["A) В одиночку, сосредоточенно.\n", "B) В команде, обмениваясь идеями.\n", "C) С клиентами, обсуждая их пожелания.\n"],
  },
  {
    question: "Как ты относишься к новому?",
    options: ["A) Предпочитаю следовать проверенным рецептам.\n", "B) Люблю экспериментировать и пробовать новое.\n", "C) Открыт к новым идеям, но с осторожностью.\n"],
  },
  {
    question: "Как ты справляешься со стрессом на кухне?",
    options: ["A) Сохраняю спокойствие и фокусируюсь на задаче.\n", "B) Нахожу поддержку у коллег или друзей.\n", "C) Превращаю стресс в креативность.\n"],
  },
  {
    question: "Что для тебя важнее в работе?",
    options: ["A) Качество и точность.\n", "B) Креативность и самовыражение.\n", "C) Общение и взаимодействие с клиентами.\n"],
  },
  {
    question: "Как ты предпочитаешь продвигать свои изделия?",
    options: ["A) Через качественные фотографии и описание.\n", "B) Через креативные видео и рецепты.\n", "C) Через общение с клиентами и отзывы.\n"],
  },
];

export const resultText = {
  A: "Вы практичный и точный кондитер.\nВам стоит сосредоточиться на качестве и стандартах. Рекомендуется развивать навыки в создании классических десертов и изучать маркетинг через визуальный контент.",
  B: "Вы креативный и инновационный кондитер.\nВам подойдут мастер-классы и эксперименты с новыми рецептами. Рассмотрите возможность ведения блога или канала на YouTube, где сможете делиться своими кулинарными экспериментами.",
  C: "Вы общительный и ориентированный на клиента кондитер.\nВам стоит развивать навыки общения и продаж. Социальные сети — ваш лучший друг, используйте их для взаимодействия с клиентами и получения обратной связи.",
};